start_user_message_text = '👋 Добро пожаловать!'
start_admin_message_text = '👋 Добро пожаловать, админ!\n' \
                           '/admin - просмотр команд админа'

new_referral_info_text = '👥 Вы стали рефералом <b>{full_name}</b>'


choose_menu_text = '👇 Выберите нужный пункт'

success_cancel_text = '❎ Ваше действие отменено'

info_message_text = "👤 Администратор бота: @{admin}"

disable_advertising_info_text = '❇️ По поводу отключения рекламы писать администратору бота\n' \
                                '👤 Администратор бота: @{admin}'

referral_system_info_text = '👥 Ваша реферальная ссылка: {link}\n\n' \
                            '👥 Число ваших рефералов: <b>{ref_count}</b>\n' \
                            '💸 Вы будете получать {percents}% на свой счёт за каждое пополнение вашим рефералом'
